#1, 2, 3 더하기[9095]
"""*******************************************************************************
 * 소요시간: 1시간
 * 시간복잡도: O(T)
 * 메모리: 32412 kb
 * 시간: 36 ms
 *******************************************************************************"""
def one_two_three(n):
    if n <= 3:
        return [0, 1, 2, 4][n]

    dp = [0] * (n + 1)

    dp[1], dp[2], dp[3] = 1, 2, 4

    for i in range(4, n + 1):
        # i를 만드는 방법의 수는 i-1, i-2, i-3을 만드는 방법의 수의 합과 같음
        dp[i] = dp[i - 1] + dp[i - 2] + dp[i - 3]

    return dp[n]

T = int(input())

for _ in range(T):
    n = int(input())
    print(one_two_three(n))



